---
kind: property
id: P:Autodesk.Revit.DB.Structure.CodeCheckingParameterServiceData.Document
zh: 文档、文件
source: html/b0cf1924-926e-2eba-1093-467c6084f1c6.htm
---
# Autodesk.Revit.DB.Structure.CodeCheckingParameterServiceData.Document Property

**中文**: 文档、文件

The current document.

## Syntax (C#)
```csharp
public Document Document { get; }
```